app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "sdfsdf\r\n"], ["post_id", 1], ["created_at", "2015-11-01 17:13:56.330033"], ["updated_at", "2015-11-01 17:13:56.330033"]]
---
    def create
	    @post = Post.find(params[:post_id])
	    @comment = @post.comments.create!(comment_params)