app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" ASC LIMIT 1
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test"], ["body", "testss"], ["created_at", "2015-11-01 16:49:04.748019"], ["updated_at", "2015-11-01 16:49:04.748019"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save